text = "こんばんは、メディアウェーブ19期の野本ですいや、始まっちゃいましたねずっとやりたいやりたいって言っててもう半年くらいやらずじまいでやっとこのメンバーも一緒にやってくれるメンバーも集まって嬉しいですね、みんなありがとうね本当に拍手してくれて本当にね、あんま知らない人が2人いるんですけどね実は話したことあるよね、なんやかんやなんやかんや話したことあるけどニッタくんも言っちゃうけどさニッタくんとこも結局さ前動画撮ったけどさこれ編集終わんなくて話してないわけ、ごめん多分引退まで引きずると思うんだけどもう入っちゃう?さっきも言っちゃったけどニッタくん自己紹介みたいなのあ、俺からかじゃあ早速僕から自己紹介を結構ね、知ってる方もいるかもしれないんですけど19期も3年ですね、今3年ののもとです皆さんお疲れ様です最近はあんまTwitterにカゴ出さなくてねなんだよこいつ、と思ってるかもしれないんですけどねちょっと自重してるんですよTwitterしたらね、ちょっといじる相手がねいすぎて、むかついちゃうんでそしたら、じゃあ高生サッカーとして今回やってくれて、じゃあニッタくん聞こえるかな?まだいけるから、大丈夫かもう高生サッカーのニッタです普段は、特に何もしないです部室何度か来たことあるんですけど部室来ても大体体重時間5分くらいなのですぐに帰っちゃうですけど今回誘われたなってこともあって目標としては部室に体制する時間を増やしたいなと思ってます部室なんかね、毎年毎年2年が選挙するみたいな風習があるらしいんだよねなんか去年も、正直そのせいでめちゃくちゃなんか下がったんよ何がと言わんか何がと言わんか下がったんで、いろいろとまあ、ほどほどにするのかけど正直言っといていいと思いますそしたら、マジで激キャラなアシスタントディレクターの森さん、森原森原、聞こえるかな?ちょっとマイク、どうする?いいかアシスタントディレクターの森ですメディアウェーブの活動、ほぼ初めてそんなしてないっけ全然してない初めてで緊張してるんで、よろしくお願いしますお願いします、本当に本当に、マジでね森原は本当にわからないガチで知らないなんか、授業とかでいるけどなんかもう、意味分かんないすぎるってさ本当にお願いします、これからで、ここでマンを持ちしてミキサーO2はい、どうもミキサーのメディアウェーブ2年20期のミキサーO2でございますみなさん、ポッドキャストですよ調子乗んなよ、お前いや、O2もね一番メディアしてくれてるよなマジですか?お前だけで押してるの、ここで心細いからあと2年生、2年生、2年生、3年だよね3年だよね、そうだよねOKOKOKOK3年代もできてないなんとも言えないじゃないですか3年生バランスいいよねこっからね、新しい人が増えたりしたらまたなんかいいかもねで、感じで軽く自己紹介をしてきましたが一応ね、タイトルとかもね決まってないんよね軽いさ、案はあるじゃんカッコ仮みたいなのはないよ、どうする?タイトルなんか書いてるけどなんで写真撮ったの?あ、言ってなかったっけ、俺知らない?あなたも知らないって軽押しでなんか言った気がする二人とも本当に分かんないんだよ言っても参加してくれる人は物質に来てくれるから喋ったりしてどんな子だなとか分かるじゃんこういう子いいなとかさこいつめっちゃ面白いじゃんとか分かるじゃないですか二人は道すぎてだから誘った知らない人が誘いたかった、あんまりあんま絡んでない人を誘いたかったオーツは、ギルツはさいったんメディアの番抜とかは来てくれてるわけじゃないですかそんで、だからそこはね2年生を選んだわけですよ2年生2人の方がいいかなそれぐらいかなそんなもんだよ理由は実際けどねみんなたまたまだけど日拓はけど前の動画にして忘れたやつでさなんかラジオ聞いてるとか言ってくれたからおうと思ったけど森晴もなんか聞いてて意外だったんよね西遊だっけ逆に何知ってますか本当だから星野源のオーダーナイトリーポンを聞いてるってことしか知らないあと授業が一個同じっていうぐらい今日俺行かなかったんだけど今日俺ちょっとね見てもいなかったそう、今日ちょっと俺いなくて、そうだもんな今日なんかねあるじゃん行きたくない日ない?一人だけ頷いてるけどモニュアルが一人だけ頷いて今日なんかさこれもあったし、放送もあったから緊張するし早めにここに居て離れしようかなってのもあってここに居たんだよそれぐらいかな日拓について知ってるのはあと埼玉かなまあまあまあまあほとんど知ってまあそんなもんだよ森原はまじで分かんないMSだよね確かそうだよねなんだよこれそれ森原はまじで知らないなMSって何ですかMSはメディア科学コースだっけ合ってるお前もだろMSはそうメディアなんかコースがねここ全部あれか同じ学部かそうじゃんMSってなんか地獄のコースにいるんだよね大変そう本当にかわいそうにまあまあまあほとんどじゃあ分かったかな大津もね大津も最近忙しそうだけどねいやまあこんな感じで最初終わらしちゃいますもうオープニングトーク結構長々と喋れてるけどねみんな割と自然体な気がするけどおお十分十分マジなんかもうプロデューサーだな高施策兼プロデューサーやんそしたらもう次のトークいっちゃいますか"
from transformers import pipeline

nlp = pipeline("fill-mask", model="cl-tohoku/bert-base-japanese-char")

def insert_char_to_sentence(i, char, sentence): # sentenceのi文字目にcharを挿入する
    l = list(sentence)
    l.insert(i, char)
    text = "".join(l)
    return text

test = "こんばんは、メディアウェーブ19期の野本ですいや、始まっちゃいましたねずっとやりたいやりたいって言っててもう半年くらいやらずじまいでやっとこのメンバーも一緒にやってくれるメンバーも集まって嬉しいですね、みんなありがとうね本当に拍手してくれて本当にね、あんま知らない人が2人いるんですけどね実は話したことあるよね、なんやかんやなんやかんや話したことあるけど"
thresh = 0.5 # このスコア以上の場合、句読点を挿入する
i = 0
punctuations = ["、", "。", "?"]
chars_after_mask = 100
corrected_sentence = test
while i < len(corrected_sentence):
    i += 1
    if corrected_sentence[i-1] in punctuations:
        continue # 句読点が連続してくることはない
    masked_text = insert_char_to_sentence(i, nlp.tokenizer.mask_token, corrected_sentence)
    pre_context, post_context = masked_text.split("。")[-1].split(nlp.tokenizer.mask_token)
    res = nlp(f"{pre_context}{nlp.tokenizer.mask_token}{post_context[:chars_after_mask]}")[0] # scoreが一番高い文
    if res["token_str"] not in punctuations:
        continue
    if res["score"] < thresh:
        continue
    punctuation = res["token_str"] if res["token_str"] != "?" else "。" # 今回は"？"は"。"として扱う
    corrected_sentence = insert_char_to_sentence(i, punctuation, corrected_sentence)
print(corrected_sentence)

# 句読点を挿入するBERTモデルを試してみたが、精度はそんなに良くなかった。
# 何より実行時間がかなり長いので、これならば初めから半角スペースを入れてくれるfaster-whisperを使った方がいい
